{
  "chat_id": "1f067908-56b4-606e-a498-f76a03bf2b88",
  "extraction_timestamp": "2025-11-18T16:10:41.351343",
  "total_messages": 1,
  "chat_info": {
    "chat_id": "1f067908-56b4-606e-a498-f76a03bf2b88",
    "name": "ТП - Сбой в работе сети",
    "type": "Channel",
    "is_public": "False",
    "is_read_only": "False",
    "owner_name": "Бадрадинов Евгений",
    "owner_id": "1ee9578a-f3f5-6e32-8e3b-d966f91c1a0a",
    "organization_id": "1ef822c2-7fd7-66cd-aa65-d7b09a6fc205",
    "description": "Поиск и устранения ошибок 0000220080 П-00006541",
    "is_notifiable": "True",
    "unread_message_count": "0",
    "started_webinar_event_id": "",
    "discovered_via_user_id": "1ee9578a-f3f5-6e32-8e3b-d966f91c1a0a",
    "extraction_timestamp": "2025-11-18T15:21:24.986638"
  },
  "messages": [
    {
      "id": "1f06790c-eb37-6f47-9345-73a537ba09ef",
      "authorId": "1ee9578a-f3f5-6e32-8e3b-d966f91c1a0a",
      "chatId": "1f067908-56b4-606e-a498-f76a03bf2b88",
      "text": "Ограничение на 64 vlan\nЧистка vlan, настроен мониторинг.\n19.11 Причина пока не выявлена. Дмитрий занимается поиском причины\n20.11 проведено тестирование. Ручное создание петель, перезагрузка ядер\n26.11  27.11 Тестирование с подключением вышедших из строя коммутаторов.\n03.12 План по настройке STP. Сейчас в значении по умолчанию\n10.12. Настроены корневые коммутаторы для STP. Пропадало подключение к exchange серверу. Настраиваем STP согласно плана Дмитрия Мосина.\n17.12. Предложение по тестированию раз в месяц работы STP (). Обозначить стоимость. Сделать подписку.\n14.01.  Устранение ошибок на портах. Расходы на ТП.\n21.01 Почистили оптику. Сбрасываем счетчики\n28.01 Виктор уточняет срок выполнения. Срок обозначить не можем. Необходимо понять где физика, где логика. На данный момент работаем прицельно по конкретным коммутаторам. Сейчас это отдел кадров. Мешают пользователи. Для диагностики необходимо привлечь подрядчика. Необходимо оценить расходы, расписать график.\nЛогические ошибки на пользовательских портах не мониторим.\nЕсть разночтения в собираемых ошибках в двух системах. \nНеобходимо провести диагностику в рамках отдельного совещания.\n04.02 Вызов подрядчика для аттестации. Ориентировочные расходы 20 т.р. + необходимо купить коммутатор для исключения того, что ошибки из-за возраста текущего оборудования, ориентировочные расходы 45 т.р. Ждем транзит около 3 недель. Возможно освободится резерв у поставщика.\n11.02 Подрядчик почистил оптику. Предварительный итог - не помогло. Ждем заключение.\nВ следующем совещании по ошибкам будет участвовать Лебедев А.Н.\n18.02 Получена часть документации от подрядчиков. Также они должны дочистить оптику.\n25.02 Работы по чистке не закончены. Коммутатор для теста еще в пути.\nЛиния СКС и инженерная группа подготовить исходные данные, текущие результаты и дальнейшие планы. Евгений Бадрадинов соберет отчет.\n04.03 Собираем данные для отчета\n11.03 Отчет направлен. Совещание на этой неделе. Необходимо взять тестовый коммутатор у Виктора.\n18.03 Необходимы 2 модуля. Запросить у Виктора - отв. Рябинина Т.\n25.03 Тестовый коммутатор будет установлен на 13 этаже на этой неделе\n01.04 Установленный новый тестовый коммутаторов 2960x. Ошибок пока нет. Продолжаем тестирование и сбор статистики 2 недели\n08.04 Продолжаем тестирование оборудованиеМониторим input errors, CRC, output errorsОсталась одна ошибка на коммутаторе в отделе кадров. \n15.04 После тестирования 2960x Ошибки. Мониторинг транков проверен.\nРаботы по 2950 завершить. Настаиваем на замену оборудования. \n29.04 Необходимо подготовить письмо по замене оборудования\n06.05 Подготовить список вендеров. \n13.05 Подготовить список коммутаторов российских производителей.\nЗаблокировались  3 коммутатора (A2711-P, A2706-P, A2133-P\n) при обновлении прошивки\n20.05 2960x 3 выписать на корпорацию, 1 на АСК-ИТ\n27.05 Счета выставлены\n10.06. 1 АСК-ИТ пришел коммутатор. Корпорация не оплатила счет.\n15.07. Коммутаторы вернулись из СЦ. Результата диагностики нет.\n",
      "createdAtMs": 1753253208930,
      "type": "Text",
      "isPersonal": false,
      "status": "Read",
      "updatedAt": null,
      "parentId": null,
      "repliedMessage": null,
      "childrenCount": null,
      "unreadChildrenCount": 0,
      "lastChild": null,
      "files": null,
      "reactions": null
    }
  ]
}