{
  "chat_id": "1f067aa6-88a4-6226-9375-839eac999ef8",
  "extraction_timestamp": "2025-11-18T16:10:47.894603",
  "total_messages": 1,
  "chat_info": {
    "chat_id": "1f067aa6-88a4-6226-9375-839eac999ef8",
    "name": "ТП - Учет расходов, подписки",
    "type": "Channel",
    "is_public": "False",
    "is_read_only": "False",
    "owner_name": "Бадрадинов Евгений",
    "owner_id": "1ee9578a-f3f5-6e32-8e3b-d966f91c1a0a",
    "organization_id": "1ef822c2-7fd7-66cd-aa65-d7b09a6fc205",
    "description": "П-00005995\nН-00148512",
    "is_notifiable": "True",
    "unread_message_count": "0",
    "started_webinar_event_id": "",
    "discovered_via_user_id": "1ee9578a-f3f5-6e32-8e3b-d966f91c1a0a",
    "extraction_timestamp": "2025-11-18T15:21:24.986638"
  },
  "messages": [
    {
      "id": "1f067aab-cc1e-6f04-9345-260a5b2bd977",
      "authorId": "1ee9578a-f3f5-6e32-8e3b-d966f91c1a0a",
      "chatId": "1f067aa6-88a4-6226-9375-839eac999ef8",
      "text": "1.  Заполнить информацию в КЕ шлюзов - указать основного и запасных провайдеров с номерами лицевых счетов - Н-00144049, отв. Мосин Д.2. Составить список провайдеров и лицевые счета, по которым необходимо написать письмо на расширение канала интернета. Нужно определить исполнителя,3. Сверить активные лицевые счета с фактически используемыми каналами интернета. Лишнее отключить.4. Сверить расходы на интернет на 40 лет Комсомола с суммой выставляемых подписок  / Ждём данных от Князевой Елены по сотрудникам\nСписки составлены. \n16.07. Увеличить скорость по той же цене может МТС. Заявка у провайдера\n23.07. Ответ не получен от МТС\n30.07 1) проведена сверка по провайдеру ИНСИС. Выявлена одна точка подключения, которой скорее всего никто не пользуется. Выключены все порты. Обращений не поступало – передано обращение на расторжение договора;\n           2) Инвестстрой задал вопрос, почему они платят за резервный канал интернета,  при аварии у основного провайдера, на второго их не переключили. Оказалось, что в апреле 2020 Лебедев А.Н. дал задачу Наталие Курочкиной расторгнуть договор на резервный канал, но задачу на редактирование подписки не передавал. Судя по переписке, хотели сэкономить. За это время мы выставили Инвестстрою 250 т.р. + НДС, но фактически канала не было. Необходимо принять решение, что отвечать клиенту и на какую сумму делать перерасчет.\n Включть резервный канал\n13.08 Отключили провайдера на машинной. В инвестстрое была проблема с DNS на 1 день в июне. Точную дату не смогли назвать.\n03.09 Сверка данных\n24.09 36 договоров 1/3 заполнено, 11 точек подключения(ИНСИС, Р-телком)\nНеобходима регулярная статистика по услуге видеотрансляции на объектах (раз в месяц)\n\nПеренести продажу интернета с агентских договоров. \n09.10  Инвестстрой отказались, на Машинной отключили, сверка в процессе.\n15.10  Провести подготовительные работы по переносу интернета с агентских договоров \n            в договор ТП.\n16.11 Подготовлена таблица с поставщиками агентских договоров. Создать совещание четверг/пятница\n03.12 Собрать сводную таблицу в МТС досках. Все наши расходы и сопоставление с пользователями услуги интернет. Собрать совещание с Курочкиной Наталией \n25.12 Сверка интернета по камерам закончена. \n28.01 Работа будет продолжена во второй половине февраля.\n11.03. Совещание с Полиной Юрьевной\n18.03 Смотрим рентабельность. Рассматриваем новый подход к подпискам \n25.03 Рентабельность посчитана. В феврале прибыль по услуге 215 т.р. Ведется подготовка к переходу на распределение расходов по учетным записям.\n08.04 Необходимо посчитать рентабельность за март. Заложить бюджеты. Разработать шаблон договор оферты. Где его публиковать. В итоге должно получиться 4 подписки.22.04 собрать совещание со Станиславом, Алексеем, Полиной Юрьевной по переноса функционала выставления счетов в новой базе\n13.05 С Алексеем осуществляем перенос подписок в Итилиум\n27.05 Расчет составлен. Причесываю и тестирую, как изменится сумма счета клиента после применения.\n03.05 Совещание с Полиной Юрьевной 06.06\n10.06 Совещание после 23 числа. Предварительно выслать материалы Полине Юрьевне.\n24.06. МТС готов увеличить скорость. Решили посмотреть на канал после внедрение МТС Линк. Существуют ограничения по расширению канала со стороны нашего оборудования.\n24.06 Форма для выставления документов. Алексей в отпуске.\n",
      "createdAtMs": 1753264345741,
      "type": "Text",
      "isPersonal": false,
      "status": "Read",
      "updatedAt": null,
      "parentId": null,
      "repliedMessage": null,
      "childrenCount": null,
      "unreadChildrenCount": 0,
      "lastChild": null,
      "files": null,
      "reactions": null
    }
  ]
}